public class Main
{
    /*
    Задание 2.7: Выведите в консоль столбец чисел от 1 до 50.
     */
    public static void main(String[] args)
    {
        for (int i=1; i <= 50; i++)
        {    System.out.println(i);
        }
    }
}
