public class Main {
    public static void main(String[] args)
    /*
    Задание 1.1
    Напишите фрагмент класса (группу комманд),
    который будет присваивать значения 5 и 9 двум переменным,
    а затем третья переменная будет получать значение,
    равное сумме значений первых двух переменных.
     */
    {
        int iPerem1=5;
        int iPerem2=9;
        int iPerem3=0;
        System.out.println(iPerem3=iPerem1+iPerem2);
    }
                   }
