public class Main {
    public static void main(String[] args)
    {
        /* Задание 1.4
        Напишите фрагмент класса, который присваивает переменной х
        целочисленное значение, а затем присваивает переменной треть
        от значения переменной х.
         */
        int x=125;
        int x_3 = 0;
        double x_33=0.0;
        System.out.println(x_3=x/3);
        System.out.println(x_33=x*1.0/3.0);
    }
}
