public class Main {
    public static void main(String[] args)
    {
        /*
    Задание 1.2
    Напишите фрагмент класса, который будет присваивать
    значение 7.5 переменной х, а затем переменным a и b будет присваивать
    значения вдвое и второе (соответственно) большие значения переменной х.
        */
        int iPerem1=5;
        int iPerem2=9;
        int iPerem3=0;
        double x=7.5;
        double a=0.0;
        double b=0.0;
        System.out.println(a=x*2);
        System.out.println(b=x*3);
    }
                    }
